_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1, 360)            129960    
_________________________________________________________________
dense_2 (Dense)              (None, 1, 200)            72200     
_________________________________________________________________
dense_3 (Dense)              (None, 1, 200)            40200     
_________________________________________________________________
dense_4 (Dense)              (None, 1, 200)            40200     
_________________________________________________________________
dense_5 (Dense)              (None, 1, 200)            40200     
_________________________________________________________________
dense_6 (Dense)              (None, 1, 36)             7236      
=================================================================
Total params: 329,996
Trainable params: 329,996
Non-trainable params: 0
_________________________________________________________________
Failed to load checkpoint
