_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1, 640)            82560     
_________________________________________________________________
dense_2 (Dense)              (None, 1, 200)            128200    
_________________________________________________________________
dense_3 (Dense)              (None, 1, 200)            40200     
_________________________________________________________________
dense_4 (Dense)              (None, 1, 200)            40200     
_________________________________________________________________
dense_5 (Dense)              (None, 1, 200)            40200     
_________________________________________________________________
dense_6 (Dense)              (None, 1, 64)             12864     
=================================================================
Total params: 344,224
Trainable params: 344,224
Non-trainable params: 0
_________________________________________________________________
Failed to load checkpoint
